#include <iostream>

using namespace std;

int main()
{
    // print number ^m
 int num, m ,p , counter;
 cout << "enter num : ";
 cin >> num;
 cout << "enter m : ";
 cin >> m ;
 p=1;
 counter =0;

 if (m==0)
 {
    cout << p << endl;
 }
 else
    for (int i=1 ; counter< m ; i++)
    {
     p *= num;
     counter += 1 ;
    }

 cout << p << endl;

}
/*1.	أولاً، تعريف المتغيرات: تبدأ البرنامج بتعريف المتغيرات num و m و p و counter.
	2.	ثم، الطلب من المستخدم إدخال الرقم الذي يرغب في رفعه للقوة والقوة التي يرغب في رفعه إليها.
	3.	بعد ذلك، يتحقق البرنامج إذا كانت قيمة m تساوي صفر. إذا كانت القيمة تساوي صفر، يطبع البرنامج القيمة الأصلية num لأن أي عدد مرفوع للقوة صفر يساوي 1.
	4.	إذا كانت قيمة m ليست صفر، يدخل البرنامج في حلقة for. يتم تعيين قيمة المتغير p إلى 1 كقيمة افتراضية.
	5.	في كل تكرار للحلقة، يتم ضرب num بنفسه m مرات (يتم تحديد عدد التكرارات بواسطة المتغير m).
	6.	يتم زيادة المتغير counter بمقدار واحد في كل تكرار للحلقة.
	7.	عندما يكون قيمة counter تساوي قيمة m، تتوقف الحلقة.
	8.	أخيرًا، يتم طباعة القيمة النهائية للعدد المرفوع للقوة.*/